[ 
    {
     "id" : 1,
     "category" : "education",
     "title" : "Write Like a Ninja: An essential toolkit for every young writer",
     "author" : "Andrew Jennings",
     "authorImg": "Andrew_Jennings",
     "author_biography" : "During the day, Andrew is a serving primary Assistant Head Teacher, KS2 Leader, English Lead and Y6 teacher, working in the North-East of England. Whilst at night, working as Vocabulary Ninja, writing books, creating educational apps, developing educational resources and working to make vocabulary a worthy priority in schools. Andrew is hugely proud to be releasing his first vocabulary publication in April 2019, followed by a series of reading comprehension books later in the year! He firmly believes that words can unlock the doors to a world of understanding and it is his passion to bring vocabulary to life in schools across the world. His experience working in a variety of school settings and educational contexts has given him a unique insight into some of the most effective strategies to engage pupils in learning, empower teaching staff and develop engaging and powerful educational resources. Words can be heart-breaking, comforting, forgiving, inspiring, enlightening. Andrew hopes that his words can inspire you, as much as he has been inspired by them. ",
     "rating" : 1,
     "image" : "img_1",
     "post_id" : "", 
     "availability" : "no",
     "availability_date" : "12 July 2021",
     "details" : "Write Like a Ninja provides children with all the vocabulary and grammar they need to become writing ninjas, as well as a handy list of Alan Peat's exciting sentences to help children vary their writing. Designed to be used independently by Key Stage 2 pupils, this is a must-have book for children to use in the classroom and at home.Fully aligned to the Key Stage 2 National Curriculum, this pocket-sized book allows children to take ownership of their writing. From examples of metaphors, similes and superlatives to verbs, conjunctions and adjectives, this is a book that children can refer to again and again to grow their confidence and gain independence in their writing. There are suggestions for avoiding commonly-used words, and vocabulary lists for describing specific settings, like haunted houses or cities and villages, as well as characters, technology, food and drink and more.Written by Andrew Jennings, creator of Vocabulary Ninja and Comprehension Ninja, this book will save teachers' time spent looking for resources and thinking of examples to give to pupils, and empower children to write independently, vary their language and become writing ninjas.",
     "purchase_url" : "https://amzn.to/2QATPqa"
    },
    {
     "id" : 2,
     "category" : "computer science",
     "title" : "Head First Kotlin: A Brain-Friendly Guide",
     "author" : "Dawn Griffiths",
     "authorImg": "Griffiths_Dawn",
     "author_biography" : "Dawn Griffiths started life as a mathematician at a top UK university where she was awarded a First-Class Honours degree in Mathematics. She went on to pursue a career in software development, and has over 15 years experience working in the IT industry. Dawn has written several books, including Head First Android Development, Head First C, Head First Statistics and Head First 2D Geometry. David Griffiths began programming at age 12, after being inspired by a documentary on the work of Seymour Papert. At age 15 he wrote an implementation of Papert's computer language LOGO. After studying Pure Mathematics at University, he began writing code for computers and magazine articles for humans and he is currently an agile coach with Exoftware in the UK, helping people to create simpler, more valuable software. He spends his free time traveling and time with his lovely wife, Dawn",
     "rating" : 4,
     "image" : "img_2",
     "post_id" : "", 
     "availability" : "yes",
     "availability_date" : "",
     "details" : "What will you learn from this book? Head First Kotlin is a complete introduction to coding in Kotlin. This hands-on book helps you learn the Kotlin language with a unique method that goes beyond syntax and how-to manuals, and teaches you how to think like a great Kotlin developer. You ll learn everything from language fundamentals to collections, generics, lambdas, and higher-order functions. Along the way, you ll get to play with both object-oriented and functional programming. If you want to really understand Kotlin, this is the book for you. Why does this book look so different? Based on the latest research in cognitive science and learning theory, Head First Kotlin uses a visually rich format to engage your mind, rather than a text-heavy approach that puts you to sleep. Why waste your time struggling with new concepts? This multi-sensory learning experience is designed for the way your brain really works.",
     "purchase_url" : "https://amzn.to/3n5gXZT"
    },
    {
        "id" : 3,
        "category" : "computer science",
        "title" : "Python All-In-One For Dummies",
        "author" : " John Shovic",
        "authorImg": "john-shovic",
        "author_biography" : "Dr. John C. Shovic is currently Chief Technical Officer of SwitchDoc Labs, LLC, a software and hardware engineering company producing specialized products and designs for the small computer industry maker movement (Raspberry Pi, Arduinos and others).",
        "rating" : 2,
        "image" : "img_3",
        "post_id" : "", 
        "availability" : "yes",
        "availability_date" : "",
        "details" : "Python is a versatile and flexible programming language that's useful in almost any type of project. This all-in-one guide offers a broad reference on the basics of Python and how to employ it in a number of applications. Seven self-contained minibooks offer an introduction to Python basics, building blocks, and libraries before walking you through how Python enhances the worlds of artificial intelligence, data science, and robotics.",
        "purchase_url" : "https://amzn.to/3dwctZc"
       },
       {
        "id" : 4,
        "category" : "fiction",
        "title" : "Purple Hibiscus",
        "author" : "Chimamanda Ngozi Adichie",
        "authorImg": "Chimamanda_Ngozi_Adichie",
        "author_biography" : "Chimamanda Ngozi ADICHIE's work has appeared in numerous publications, including The New Yorker and Granta. She is the author of the novels Purple Hibiscus; Half of a Yellow Sun, which won the Orange Prize; Americanah, which won the NBCC Award and was a New York Times, Washington Post, Chicago Tribune, and Entertainment Weekly Best Book of the Year; the story collection The Thing Around Your Neck; and the essay We Should All Be Feminists. A recipient of a MacArthur Fellowship, she divides her time between the United States and Nigeria.",
        "rating" : 4,
        "image" : "img_4",
        "post_id" : "", 
        "availability" : "yes",
        "availability_date" : "",
        "details" : "The limits of fifteen-year-old Kambili’s world are defined by the high walls of her family estate and the dictates of her fanatically religious father. Her life is regulated by schedules: prayer, sleep, study, prayer. When Nigeria is shaken by a military coup, Kambili’s father, involved mysteriously in the political crisis, sends her to live with her aunt. In this house, noisy and full of laughter, she discovers life and love – and a terrible, bruising secret deep within her family. This extraordinary debut novel from Chimamanda Ngozi Adichie, author of ‘Half of a Yellow Sun’, is about the blurred lines between the old gods and the new, childhood and adulthood, love and hatred – the grey spaces in which truths are revealed and real life is lived.",
        "purchase_url" : "https://amzn.to/32tsNUv"
       },
       {
        "id" : 5,
        "category" : "computer science",
        "title" : "The Lean Startup",
        "author" : "Eric Ries",
        "authorImg": "Eric_Ries",
        "author_biography" : "Eric Ries (born September 22, 1978) is an American entrepreneur, blogger, and author of The Lean Startup, a book on the lean startup movement. He is also the author of The Startup Way, a book on modern entrepreneurial management",
        "rating" : 4,
        "image" : "img_5",
        "post_id" : "", 
        "availability" : "no",
        "availability_date" : "20 July 2021",
        "details" : "The Lean Startup is the approach to business that's being adopted around the world. It is changing the way companies are built and new products are launched. The Lean Startup is about learning what your customers really want. It's about testing your vision continuously, adapting and adjusting before it's too late. Now is the time to think Lean.",
        "purchase_url" : "https://amzn.to/32wfti4"
       },
       {
        "id" : 6,
        "category" : "cook book",
        "title" : "The Fast 800 Recipe Book",
        "author" : " Dr Clare Bailey, Justine Pattison",
        "authorImg": "Dr-Clare-Bailey",
        "author_biography" : "Dr Clare Bailey, GP, and acclaimed food writer Justine Pattison have created meals which are tasty and easy to make, from breakfasts and brunches, soups and shakes to more substantial suppers and even occasional indulgent treats. All the recipes are based on the low-carb Mediterranean style of eating now proven to revolutionise your health. Whether you are embarking on an intensive weight-loss programme to prevent or reverse Type 2 diabetes, or simply want to bring down your blood pressure and cholesterol and improve your mood and general health, The Fast 800 Recipe Book will inspire you to change the way you eat for ever.",
        "rating" : 3,
        "image" : "img_6",
        "post_id" : "", 
        "availability" : "yes",
        "availability_date" : "",
        "details" : "Following Dr Michael Mosley's No.1 bestselling Fast 800, this fabulous companion cookbook offers a collection of delicious, nutritious recipes to help you incorporate the new 800-calorie programme into your daily life.",
        "purchase_url" : "https://amzn.to/32vAIAy"
       }
   
        
]